'use client';

import { DiaryNote } from '@/types/diaryNote';
import { DiaryEntryCard } from '../DiaryEntryCard/DiaryEntryCard';
import styles from './DiaryList.module.css';

interface DiaryListProps {
  notes: DiaryNote[];
  selectedNoteId?: string;
  onSelectNote: (note: DiaryNote) => void;
  onOpenAddModal?: () => void;
}

export const DiaryList = ({
  notes,
  selectedNoteId,
  onSelectNote,
  onOpenAddModal,
}: DiaryListProps) => {
  return (
    <div className={styles.container}>
      <div className={styles.title}>
        <h2 className={styles.heading}>Ваші записи</h2>

        <div className={styles.createContainer}>
          <button
            type="button"
            className={styles.addBtn}
            onClick={onOpenAddModal}
            aria-label="Додати новий запис"
          >
            <span className={styles.addText}>Новий запис</span>
            <svg
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
              className={styles.iconPlus}
              aria-hidden="true"
            >
              <path
                d="M11.2893 12.885V16.2492C11.2893 16.4719 11.3642 16.6586 11.5138 16.8092C11.6637 16.9598 11.8523 17.035 12.0796 17.035C12.3068 17.035 12.4938 16.9606 12.6406 16.8117C12.7874 16.6627 12.8608 16.4747 12.8608 16.2477V12.885H16.2501C16.4728 12.885 16.6594 12.8102 16.8101 12.6605C16.9606 12.5107 17.0358 12.3221 17.0358 12.0947C17.0358 11.8676 16.9614 11.6806 16.8126 11.5337C16.6636 11.3869 16.4756 11.3135 16.2486 11.3135H12.8608V7.74925C12.8608 7.52658 12.786 7.33992 12.6363 7.18925C12.4865 7.03875 12.2979 6.9635 12.0706 6.9635C11.8434 6.9635 11.6564 7.03792 11.5096 7.18675C11.3628 7.33575 11.2893 7.52375 11.2893 7.75075V11.3135H7.75009C7.52742 11.3135 7.34075 11.3883 7.19009 11.538C7.03959 11.6878 6.96434 11.8764 6.96434 12.1037C6.96434 12.3309 7.03875 12.5179 7.18759 12.6647C7.33659 12.8116 7.52459 12.885 7.75159 12.885H11.2893ZM12.0076 22.1487C10.6043 22.1487 9.28725 21.8831 8.05659 21.3517C6.82592 20.8204 5.74959 20.0938 4.82759 19.1718C3.90559 18.2498 3.17892 17.1731 2.64759 15.9417C2.11625 14.7104 1.85059 13.3923 1.85059 11.9875C1.85059 10.5828 2.11625 9.2645 2.64759 8.0325C3.17892 6.80067 3.90525 5.72783 4.82659 4.814C5.74792 3.9 6.82442 3.1765 8.05609 2.6435C9.28775 2.11033 10.6062 1.84375 12.0113 1.84375C13.4163 1.84375 14.7351 2.11017 15.9676 2.643C17.1999 3.17583 18.2728 3.89892 19.1863 4.81225C20.1 5.72558 20.8233 6.79958 21.3561 8.03425C21.8891 9.26892 22.1556 10.5883 22.1556 11.9925C22.1556 13.3965 21.889 14.7137 21.3558 15.9442C20.8228 17.1749 20.0993 18.2495 19.1853 19.168C18.2715 20.0863 17.1976 20.8127 15.9636 21.3472C14.7296 21.8816 13.4109 22.1487 12.0076 22.1487ZM12.0126 20.4455C14.3549 20.4455 16.3462 19.6226 17.9863 17.9767C19.6263 16.3307 20.4463 14.3341 20.4463 11.9867C20.4463 9.64442 19.6278 7.65317 17.9908 6.013C16.354 4.373 14.3561 3.553 11.9971 3.553C9.66109 3.553 7.66984 4.3715 6.02334 6.0085C4.377 7.64533 3.55384 9.64325 3.55384 12.0022C3.55384 14.3382 4.37675 16.3295 6.02259 17.976C7.66859 19.6223 9.66525 20.4455 12.0126 20.4455Z"
                fill="currentColor"
              />
            </svg>
          </button>
        </div>
      </div>

      <div className={styles.list}>
        {notes.length === 0 ? (
          <p className={styles.emptyText}>Наразі записи у щоденнику відсутні</p>
        ) : (
          notes.map((note) => (
            <DiaryEntryCard
              key={note._id}
              note={note}
              isSelected={note._id === selectedNoteId}
              onClick={() => onSelectNote(note)}
            />
          ))
        )}
      </div>
    </div>
  );
};